MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128DA110/mcu.h
#define G1CLUT G1CLUT
extern volatile uint16_t G1CLUT __attribute__((__sfr__));
__extension__ typedef struct tagG1CLUTBITS {
  union {
    struct {
      uint16_t CLUTADR:8;
      uint16_t CLUTRWEN:1;
      uint16_t CLUTTRD:1;
      uint16_t :4;
      uint16_t CLUTBUSY:1;
      uint16_t CLUTEN:1;
    };
    struct {
      uint16_t CLUTADR0:1;
      uint16_t CLUTADR1:1;
      uint16_t CLUTADR2:1;
      uint16_t CLUTADR3:1;
      uint16_t CLUTADR4:1;
      uint16_t CLUTADR5:1;
      uint16_t CLUTADR6:1;
      uint16_t CLUTADR7:1;
    };
  };
} G1CLUTBITS;
extern volatile G1CLUTBITS G1CLUTbits __attribute__((__sfr__));

#define G1CLUTWR G1CLUTWR
extern volatile uint16_t G1CLUTWR __attribute__((__sfr__));
__extension__ typedef struct tagG1CLUTWRBITS {
  union {
    struct {
      uint16_t CLUTWR:16;
    };
    struct {
      uint16_t CLUTWR0:1;
      uint16_t CLUTWR1:1;
      uint16_t CLUTWR2:1;
      uint16_t CLUTWR3:1;
      uint16_t CLUTWR4:1;
      uint16_t CLUTWR5:1;
      uint16_t CLUTWR6:1;
      uint16_t CLUTWR7:1;
      uint16_t CLUTWR8:1;
      uint16_t CLUTWR9:1;
      uint16_t CLUTWR10:1;
      uint16_t CLUTWR11:1;
      uint16_t CLUTWR12:1;
      uint16_t CLUTWR13:1;
      uint16_t CLUTWR14:1;
      uint16_t CLUTWR15:1;
    };
  };
} G1CLUTWRBITS;
extern volatile G1CLUTWRBITS G1CLUTWRbits __attribute__((__sfr__));

#define G1CLUTRD G1CLUTRD
extern volatile uint16_t G1CLUTRD __attribute__((__sfr__));
__extension__ typedef struct tagG1CLUTRDBITS {
  union {
    struct {
      uint16_t CLUTRD:16;
    };
    struct {
      uint16_t CLUTRD0:1;
      uint16_t CLUTRD1:1;
      uint16_t CLUTRD2:1;
      uint16_t CLUTRD3:1;
      uint16_t CLUTRD4:1;
      uint16_t CLUTRD5:1;
      uint16_t CLUTRD6:1;
      uint16_t CLUTRD7:1;
      uint16_t CLUTRD8:1;
      uint16_t CLUTRD9:1;
      uint16_t CLUTRD10:1;
      uint16_t CLUTRD11:1;
      uint16_t CLUTRD12:1;
      uint16_t CLUTRD13:1;
      uint16_t CLUTRD14:1;
      uint16_t CLUTRD15:1;
    };
  };
} G1CLUTRDBITS;
extern volatile G1CLUTRDBITS G1CLUTRDbits __attribute__((__sfr__));

#define G1MRGN G1MRGN
extern volatile uint16_t G1MRGN __attribute__((__sfr__));
__extension__ typedef struct tagG1MRGNBITS {
  union {
    struct {
      uint16_t HBAMGN:8;
      uint16_t VBAMGN:8;
    };
    struct {
      uint16_t HBAMGN0:1;
      uint16_t HBAMGN1:1;
      uint16_t HBAMGN2:1;
      uint16_t HBAMGN3:1;
      uint16_t HBAMGN4:1;
      uint16_t HBAMGN5:1;
      uint16_t HBAMGN6:1;
      uint16_t HBAMGN7:1;
      uint16_t VBAMGN0:1;
      uint16_t VBAMGN1:1;
      uint16_t VBAMGN2:1;
      uint16_t VBAMGN3:1;
      uint16_t VBAMGN4:1;
      uint16_t VBAMGN5:1;
      uint16_t VBAMGN6:1;
      uint16_t VBAMGN7:1;
    };
  };
} G1MRGNBITS;
extern volatile G1MRGNBITS G1MRGNbits __attribute__((__sfr__));

#define G1CHRX G1CHRX
extern volatile uint16_t G1CHRX __attribute__((__sfr__));
__extension__ typedef struct tagG1CHRXBITS {
  union {
    struct {
      uint16_t CURPOSX:11;
    };
    struct {
      uint16_t CURPOSX0:1;
      uint16_t CURPOSX1:1;
      uint16_t CURPOSX2:1;
      uint16_t CURPOSX3:1;
      uint16_t CURPOSX4:1;
      uint16_t CURPOSX5:1;
      uint16_t CURPOSX6:1;
      uint16_t CURPOSX7:1;
      uint16_t CURPOSX8:1;
      uint16_t CURPOSX9:1;
      uint16_t CURPOSX10:1;
    };
  };
} G1CHRXBITS;
extern volatile G1CHRXBITS G1CHRXbits __attribute__((__sfr__));

#define G1CHRY G1CHRY
extern volatile uint16_t G1CHRY __attribute__((__sfr__));
__extension__ typedef struct tagG1CHRYBITS {
  union {
    struct {
      uint16_t CURPOSY:11;
    };
    struct {
      uint16_t CURPOSY0:1;
      uint16_t CURPOSY1:1;
      uint16_t CURPOSY2:1;
      uint16_t CURPOSY3:1;
      uint16_t CURPOSY4:1;
      uint16_t CURPOSY5:1;
      uint16_t CURPOSY6:1;
      uint16_t CURPOSY7:1;
      uint16_t CURPOSY8:1;
      uint16_t CURPOSY9:1;
      uint16_t CURPOSY10:1;
    };
  };
} G1CHRYBITS;
extern volatile G1CHRYBITS G1CHRYbits __attribute__((__sfr__));

#define G1IPU G1IPU
extern volatile uint16_t G1IPU __attribute__((__sfr__));
typedef struct tagG1IPUBITS {
  uint16_t BFINAL:1;
  uint16_t IPUDONE:1;
  uint16_t WRAPERR:1;
  uint16_t LENERR:1;
  uint16_t BLCKERR:1;
  uint16_t HUFFERR:1;
} G1IPUBITS;
extern volatile G1IPUBITS G1IPUbits __attribute__((__sfr__));

#define G1DBEN G1DBEN
extern volatile uint16_t G1DBEN __attribute__((__sfr__));
__extension__ typedef struct tagG1DBENBITS {
  union {
    struct {
      uint16_t GDBEN:16;
    };
    struct {
      uint16_t GDBEN0:1;
      uint16_t GDBEN1:1;
      uint16_t GDBEN2:1;
      uint16_t GDBEN3:1;
      uint16_t GDBEN4:1;
      uint16_t GDBEN5:1;
      uint16_t GDBEN6:1;
      uint16_t GDBEN7:1;
      uint16_t GDBEN8:1;
      uint16_t GDBEN9:1;
      uint16_t GDBEN10:1;
      uint16_t GDBEN11:1;
      uint16_t GDBEN12:1;
      uint16_t GDBEN13:1;
      uint16_t GDBEN14:1;
      uint16_t GDBEN15:1;
    };
  };
} G1DBENBITS;
extern volatile G1DBENBITS G1DBENbits __attribute__((__sfr__));

#define RCON RCON
extern volatile uint16_t RCON __attribute__((__sfr__));
__extension__ typedef struct tagRCONBITS {
  union {
    struct {
      uint16_t POR:1;
      uint16_t BOR:1;
      uint16_t IDLE:1;
      uint16_t SLEEP:1;
      uint16_t WDTO:1;
      uint16_t SWDTEN:1;
      uint16_t SWR:1;
      uint16_t EXTR:1;
      uint16_t VREGS:1;
      uint16_t CM:1;
      uint16_t :4;
      uint16_t IOPUWR:1;
      uint16_t TRAPR:1;
    };
    struct {
      uint16_t :8;
      uint16_t PMSLP:1;
    };
  };
} RCONBITS;
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define OSCCON OSCCON
extern volatile uint16_t OSCCON __attribute__((__sfr__));
__extension__ typedef struct tagOSCCONBITS {
  union {
    struct {
      uint16_t OSWEN:1;
      uint16_t SOSCEN:1;
      uint16_t POSCEN:1;
      uint16_t CF:1;
      uint16_t :1;
      uint16_t LOCK:1;
      uint16_t IOLOCK:1;
      uint16_t CLKLOCK:1;
      uint16_t NOSC:3;
      uint16_t :1;
      uint16_t COSC:3;
    };
    struct {
      uint16_t :1;
      uint16_t LPOSCEN:1;
      uint16_t :6;
      uint16_t NOSC0:1;
      uint16_t NOSC1:1;
      uint16_t NOSC2:1;
      uint16_t :1;
      uint16_t COSC0:1;
      uint16_t COSC1:1;
      uint16_t COSC2:1;
    };
  };
} OSCCONBITS;
extern volatile OSCCONBITS OSCCONbits __attribute__((__sfr__));

