MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128DA110/mcu.h
#define _G1IR_RCCIF_POSITION                     0x00000006
#define _G1IR_RCCIF_MASK                         0x00000040
#define _G1IR_RCCIF_LENGTH                       0x00000001

#define _G1IR_IPUIF_POSITION                     0x00000007
#define _G1IR_IPUIF_MASK                         0x00000080
#define _G1IR_IPUIF_LENGTH                       0x00000001

#define _G1IR_PUIF_POSITION                      0x0000000F
#define _G1IR_PUIF_MASK                          0x00008000
#define _G1IR_PUIF_LENGTH                        0x00000001

#define _G1W1ADRL_W1ADR0_POSITION                0x00000000
#define _G1W1ADRL_W1ADR0_MASK                    0x00000001
#define _G1W1ADRL_W1ADR0_LENGTH                  0x00000001

#define _G1W1ADRL_W1ADR1_POSITION                0x00000001
#define _G1W1ADRL_W1ADR1_MASK                    0x00000002
#define _G1W1ADRL_W1ADR1_LENGTH                  0x00000001

#define _G1W1ADRL_W1ADR2_POSITION                0x00000002
#define _G1W1ADRL_W1ADR2_MASK                    0x00000004
#define _G1W1ADRL_W1ADR2_LENGTH                  0x00000001

#define _G1W1ADRL_W1ADR3_POSITION                0x00000003
#define _G1W1ADRL_W1ADR3_MASK                    0x00000008
#define _G1W1ADRL_W1ADR3_LENGTH                  0x00000001

#define _G1W1ADRL_W1ADR4_POSITION                0x00000004
#define _G1W1ADRL_W1ADR4_MASK                    0x00000010
#define _G1W1ADRL_W1ADR4_LENGTH                  0x00000001

#define _G1W1ADRL_W1ADR5_POSITION                0x00000005
#define _G1W1ADRL_W1ADR5_MASK                    0x00000020
#define _G1W1ADRL_W1ADR5_LENGTH                  0x00000001

#define _G1W1ADRL_W1ADR6_POSITION                0x00000006
#define _G1W1ADRL_W1ADR6_MASK                    0x00000040
#define _G1W1ADRL_W1ADR6_LENGTH                  0x00000001

#define _G1W1ADRL_W1ADR7_POSITION                0x00000007
#define _G1W1ADRL_W1ADR7_MASK                    0x00000080
#define _G1W1ADRL_W1ADR7_LENGTH                  0x00000001

#define _G1W1ADRL_W1ADR8_POSITION                0x00000008
#define _G1W1ADRL_W1ADR8_MASK                    0x00000100
#define _G1W1ADRL_W1ADR8_LENGTH                  0x00000001

#define _G1W1ADRL_W1ADR9_POSITION                0x00000009
#define _G1W1ADRL_W1ADR9_MASK                    0x00000200
#define _G1W1ADRL_W1ADR9_LENGTH                  0x00000001

#define _G1W1ADRL_W1ADR10_POSITION               0x0000000A
#define _G1W1ADRL_W1ADR10_MASK                   0x00000400
#define _G1W1ADRL_W1ADR10_LENGTH                 0x00000001

#define _G1W1ADRL_W1ADR11_POSITION               0x0000000B
#define _G1W1ADRL_W1ADR11_MASK                   0x00000800
#define _G1W1ADRL_W1ADR11_LENGTH                 0x00000001

#define _G1W1ADRL_W1ADR12_POSITION               0x0000000C
#define _G1W1ADRL_W1ADR12_MASK                   0x00001000
#define _G1W1ADRL_W1ADR12_LENGTH                 0x00000001

#define _G1W1ADRL_W1ADR13_POSITION               0x0000000D
#define _G1W1ADRL_W1ADR13_MASK                   0x00002000
#define _G1W1ADRL_W1ADR13_LENGTH                 0x00000001

#define _G1W1ADRL_W1ADR14_POSITION               0x0000000E
#define _G1W1ADRL_W1ADR14_MASK                   0x00004000
#define _G1W1ADRL_W1ADR14_LENGTH                 0x00000001

#define _G1W1ADRL_W1ADR15_POSITION               0x0000000F
#define _G1W1ADRL_W1ADR15_MASK                   0x00008000
#define _G1W1ADRL_W1ADR15_LENGTH                 0x00000001

#define _G1W1ADRH_W1ADR16_POSITION               0x00000000
#define _G1W1ADRH_W1ADR16_MASK                   0x00000001
#define _G1W1ADRH_W1ADR16_LENGTH                 0x00000001

#define _G1W1ADRH_W1ADR17_POSITION               0x00000001
#define _G1W1ADRH_W1ADR17_MASK                   0x00000002
#define _G1W1ADRH_W1ADR17_LENGTH                 0x00000001

#define _G1W1ADRH_W1ADR18_POSITION               0x00000002
#define _G1W1ADRH_W1ADR18_MASK                   0x00000004
#define _G1W1ADRH_W1ADR18_LENGTH                 0x00000001

#define _G1W1ADRH_W1ADR19_POSITION               0x00000003
#define _G1W1ADRH_W1ADR19_MASK                   0x00000008
#define _G1W1ADRH_W1ADR19_LENGTH                 0x00000001

#define _G1W1ADRH_W1ADR20_POSITION               0x00000004
#define _G1W1ADRH_W1ADR20_MASK                   0x00000010
#define _G1W1ADRH_W1ADR20_LENGTH                 0x00000001

#define _G1W1ADRH_W1ADR21_POSITION               0x00000005
#define _G1W1ADRH_W1ADR21_MASK                   0x00000020
#define _G1W1ADRH_W1ADR21_LENGTH                 0x00000001

#define _G1W1ADRH_W1ADR22_POSITION               0x00000006
#define _G1W1ADRH_W1ADR22_MASK                   0x00000040
#define _G1W1ADRH_W1ADR22_LENGTH                 0x00000001

#define _G1W1ADRH_W1ADR23_POSITION               0x00000007
#define _G1W1ADRH_W1ADR23_MASK                   0x00000080
#define _G1W1ADRH_W1ADR23_LENGTH                 0x00000001

#define _G1W2ADRL_W2ADR0_POSITION                0x00000000
#define _G1W2ADRL_W2ADR0_MASK                    0x00000001
#define _G1W2ADRL_W2ADR0_LENGTH                  0x00000001

#define _G1W2ADRL_W2ADR1_POSITION                0x00000001
#define _G1W2ADRL_W2ADR1_MASK                    0x00000002
#define _G1W2ADRL_W2ADR1_LENGTH                  0x00000001

#define _G1W2ADRL_W2ADR2_POSITION                0x00000002
#define _G1W2ADRL_W2ADR2_MASK                    0x00000004
#define _G1W2ADRL_W2ADR2_LENGTH                  0x00000001

#define _G1W2ADRL_W2ADR3_POSITION                0x00000003
#define _G1W2ADRL_W2ADR3_MASK                    0x00000008
#define _G1W2ADRL_W2ADR3_LENGTH                  0x00000001

#define _G1W2ADRL_W2ADR4_POSITION                0x00000004
#define _G1W2ADRL_W2ADR4_MASK                    0x00000010
#define _G1W2ADRL_W2ADR4_LENGTH                  0x00000001

#define _G1W2ADRL_W2ADR5_POSITION                0x00000005
#define _G1W2ADRL_W2ADR5_MASK                    0x00000020
#define _G1W2ADRL_W2ADR5_LENGTH                  0x00000001

#define _G1W2ADRL_W2ADR6_POSITION                0x00000006
#define _G1W2ADRL_W2ADR6_MASK                    0x00000040
#define _G1W2ADRL_W2ADR6_LENGTH                  0x00000001

#define _G1W2ADRL_W2ADR7_POSITION                0x00000007
#define _G1W2ADRL_W2ADR7_MASK                    0x00000080
#define _G1W2ADRL_W2ADR7_LENGTH                  0x00000001

